{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing two UI-related footer updates and their associated files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose and behavior of multiple frontend components and pages.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme CSS variables and global base styles.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app handling hash-based routing and rendering pages with header, footer, and WhatsApp button.",
  "frontend/src/components/site/AppointmentWidget.tsx": "Appointment form that collects user details and opens WhatsApp with a prefilled message.",
  "frontend/src/components/site/CallLink.tsx": "Reusable phone link component rendering a tel: anchor with an icon.",
  "frontend/src/components/site/FloatingWhatsAppButton.tsx": "Floating action button that opens WhatsApp with a default message.",
  "frontend/src/components/site/Footer.tsx": "Footer with clinic info, quick links, and action buttons including fixed single‑icon WhatsApp and centered Get Directions.",
  "frontend/src/components/site/GetDirectionsLink.tsx": "Button that opens Google Maps to the clinic address with centered icon and text.",
  "frontend/src/components/site/GoogleMapEmbed.tsx": "Embeds Google Maps iframe showing the clinic location.",
  "frontend/src/components/site/Header.tsx": "Responsive header with navigation, language toggle, logo, and mobile menu handling.",
  "frontend/src/components/site/LanguageToggle.tsx": "Button that switches the app language between English and Hindi.",
  "frontend/src/components/site/Section.tsx": "Wrapper component that renders a padded section with optional custom classes.",
  "frontend/src/components/site/ThemePrimitives.tsx": "Basic UI primitives including Card, CardContent, and Container with styling wrappers.",
  "frontend/src/components/site/WhatsAppLink.tsx": "Button that opens a WhatsApp chat with a prefilled message using clinic phone info.",
  "frontend/src/content/clinic.ts": "Static clinic metadata including name, doctors, contact details, and hours.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/usePageMeta.ts": "Hook that sets the document title and description meta tag.",
  "frontend/src/i18n/LanguageProvider.tsx": "Context provider storing the current language and translation helper with localStorage persistence.",
  "frontend/src/i18n/strings.ts": "English and Hindi translation strings for navigation, UI sections, and clinic content.",
  "frontend/src/index.css": "Global styles and Tailwind config layers defining fonts, variables, utilities, and component classes.",
  "frontend/src/main.tsx": "App entry point that sets up React Query, Internet Identity provider, and renders the main App.",
  "frontend/src/pages/AboutDoctorsPage.tsx": "Renders the About Doctors page with hero text, doctor profiles using translations, and visual sections using cards and images.",
  "frontend/src/pages/HomePage.tsx": "Renders the Home page with hero content, services overview, testimonials, CTAs, and map embed using translated text.",
  "frontend/src/pages/ServicesContactPage.tsx": "Renders the Services & Contact page with hero section, services list, FAQs, and appointment/location components.",
  "frontend/tailwind.config.js": "Configures Tailwind settings, theme extensions, colors, fonts, spacing, shadows, and plugin usage.",
  "project_state.json": "Describes current project requirements, specs, known issues, and supported features for the site build."
}